import Section from "app/components/Section";
import Image from "next/image";

export default function About() {
  return (
    <div className='bg-gray-100 flex flex-col items-center'>
      {/* About Us Section */}
      <Section
        title='Σχετικά με Εμάς'
        imageSrc='/images/pexels-namal-siriwardana-162265496-27183711.jpg' // Replace with actual image
        content={[
          "Περιμένουμε πως και πως το Σαββατοκύριακο για να χαλαρώσεις; Μπορούμε να σου προσφέρουμε κάτι διαφορετικό.",
          "Θέλουμε να σου προσφέρουμε μια εμπειρία που θα σε συναρπάσει. Γιατί η παρέα του Δραστήριου Κατσικιού δημιουργήθηκε για την ανάγκη μας να ταξιδέψουμε.",
          "Στόχος μας είναι να επανασυνδεθούμε με την ελληνική φύση και τις δραστηριότητες. Θες/Θέλεις εσύ να ασχοληθείς με τις υπαίθριες δραστηριότητες;",
        ]}
      />

      {/* History Section */}
      <Section
        title='Ιστορία της Ομάδας'
        imageSrc='/images/pexels-stanswinnen-6465964.jpg' // Replace with actual image
        content={[
          "Η ομάδα μας δημιουργήθηκε πριν από 10 χρόνια με σκοπό να ενθαρρύνει την εξερεύνηση της φύσης.",
          "Ξεκινήσαμε με μικρές πεζοπορίες σε τοπικά μονοπάτια, αλλά η αγάπη μας για το βουνό και την περιπέτεια μας έφερε πιο κοντά.",
          "Σήμερα, οργανώνουμε πολυήμερες εκδρομές και δραστηριότητες για όλους όσοι αγαπούν την περιπέτεια και την εξερεύνηση.",
        ]}
      />

      {/* CV Section */}
      <Section
        title='Βιογραφικό της Ομάδας'
        imageSrc='/images/pexels-y-d-179881567-15575660.jpg' // Replace with actual image
        content={[
          "Η ομάδα μας αποτελείται από έμπειρους οδηγούς, φυσιολάτρες και εκπαιδευτές ορειβασίας.",
          "Καθένας από εμάς φέρει μοναδικές δεξιότητες και εμπειρίες που εμπλουτίζουν κάθε δραστηριότητα.",
          "Είμαστε εδώ για να σας καθοδηγήσουμε, να σας εμπνεύσουμε και να σας βοηθήσουμε να ανακαλύψετε νέες πτυχές της φύσης.",
        ]}
      />
      <Image
        src='/images/divider.png'
        alt='divider'
        className='object-cover mt-4'
        width={200}
        height={30}
      />
    </div>
  );
}
